compressible/dpEqn_Semi-Implicit_Inplace_GCIBM-plane/case/0/gas/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    TOP
    {
        type            advective;
        field           T;
        phi             USn;
        fieldInf        300;
        value           $internalField;
    }

    BOTTOM
    {
        type            fixedValue;
        value           uniform 300;
    }

    FRONT
    {
        type            zeroGradient;
    }

    BACK
    {
        type            zeroGradient;
    }

    LEFT
    {
        type            zeroGradient;
    }

    RIGHT
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
